<a href="https://colab.research.google.com/github/abhinavsahu2739-art/Pandas-Data-cleaning-Project/blob/main/Pandas_Datacleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [12]:
# 1 Importing Pandas and load csv file
import pandas as pd
df=pd.read_csv("customers.csv")
##  Q1 Display first rows
df.head(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India

In [13]:
## Q2 Display last 5 rows
df.tail(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
## Q3 Display numbers of rows & columns
df.shape

(10200, 12)

In [ ]:
## Q4 Display column names
df.columns

Index(['Customer_ID', 'Name', 'Gender', 'Age', 'City', 'Signup_Date',
       'Last_Purchase_Date', 'Purchase_Amount', 'Feedback_Score', 'Email',
       'Phone_Number', 'Country'],
      dtype='object')

In [ ]:
## Q5 Data types, missing values, memory usage
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                10200 non-null  object
 2   Gender              9174 non-null   object
 3   Age                 9249 non-null   object
 4   City                9184 non-null   object
 5   Signup_Date         10200 non-null  object
 6   Last_Purchase_Date  9188 non-null   object
 7   Purchase_Amount     9179 non-null   float64
 8   Feedback_Score      9177 non-null   float64
 9   Email               10200 non-null  object
 10  Phone_Number        10200 non-null  int64
 11  Country             9468 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 956.4+ KB

In [ ]:
## Q6 Display select specific columns
df[["Customer_ID","Name","City","Purchase_Amount"]]

      Customer_ID               Name         City  Purchase_Amount
0        CUST4371        Paul Wilson     KOLKATA           26944.0
1        CUST5957       Jason Thomas          NaN          44152.0
2        CUST3754  Brittney Martinez   hyderabad           31745.0
3        CUST2934      Brenda Pierce   hyderabad           39674.0
4        CUST5683    Matthew Carroll     CHENNAI               NaN
...           ...                ...          ...              ...
10195   CUST10767       Robert Lewis       delhi           24167.0
10196         NaN        Diane Evans   bangalore           11639.0
10197    CUST6315    Joshua Martinez   hyderabad           43832.0
10198    CUST4812       Sarah Miller          NaN          18827.0
10199    CUST6588       David Potter   HYDERABAD           35211.0

[10200 rows x 4 columns]

In [2]:
## Q7 Customers from chennai
df["City"]=df["City"].str.strip()

In [ ]:
df["City"].unique()

array(['KOLKATA', nan, 'hyderabad', 'CHENNAI', 'kolkata', 'BANGALORE',
       'Hyderabad', 'HYDERABAD', 'Mumbai', 'chennai', 'Delhi',
       'bangalore', 'MUMBAI', 'Bangalore', 'Kolkata', 'delhi', 'Chennai',
       'mumbai', 'DELHI'], dtype=object)

In [ ]:
df.loc[df["City"].str.upper()=="CHENNAI"]   # data filtering

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
14,CUST8398,James Ruiz,male,59.0,chennai,2024-08-07,2025-09-03,39876.0,4.0,benjamin18@example.org,5825026489,India
29,CUST9357,Robert Scott MD,F,50.0,chennai,2024-01-09,2024-12-31,14419.0,10.0,buchananbrooke@example.org,7106174948,India
45,CUST9285,Anita Wright,male,28.0,chennai,2023-01-19,2025-06-27,4607.0,9.0,bethclark@example.com,5354281362,india
...,...,...,...,...,...,...,...,...,...,...,...,...
10174,CUST5257,Kelly May,M,54.0,Chennai,2024-10-07,2024-11-29,29589.0,2.0,larrymorris@example.com,785850786,India
10179,NaN,Tracie Wiley,f,23.0,Chennai,2022-09-13,2025-08-24,36823.0,5.0,sanderssamuel@example.net,1344614078,India
10180,NaN,Marco Davis,m,35.0,Chennai,2024-07-06,2025-05-07,22827.0,6.0,uperkins@example.net,2381937965,India
10187,CUST5607,Rebecca Gibson,m,43.0,chennai,2021-10-31,2025-10-05,35695.0,6.0,maryhart@example.net,3382653632,India
10188,NaN,Ashley Dunn,MALE,67.0,CHENNAI,2023-03-07,2024-12-09,45534.0,9.0,loribenson@example.com,5556223952,india

In [3]:
## Q8 Customers whose Country is India

df[df["Country"]=="India"]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18.0,BANGALORE,2024-06-16,2025-04-25,NaN,3.0,ymiranda@example.net,6917110630,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

It appears there was a typo in the city name. The correct spelling is 'CHENNAI'. Let's try filtering for 'CHENNAI' instead.

In [ ]:
## Q9 Display purchase_amount > 30000.
df.loc[df["Purchase_Amount"]>30000]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
10,CUST3260,Jason Mack,MALE,32.0,HYDERABAD,2024-08-14,2025-01-20,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,female,22.0,Mumbai,2023-10-14,2025-04-24,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
## Q10 Count male & female customers
df["Gender"].value_counts()

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64

In [ ]:
## Q11 Missing values in each column
df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [ ]:
## Q12 customers with missing purchase _amount
df["Purchase_Amount"].isnull().sum()

np.int64(1021)

In [ ]:
##  Q13 Replace missing purchase amount
mean_purchased_amount=df["Purchase_Amount"].mean()
df.fillna(mean_purchased_amount,inplace=True)
df["Purchase_Amount"].isnull().sum()

np.int64(0)

In [ ]:
#Q14 missing values in city column
df["City"].isnull().sum()

np.int64(0)

In [ ]:
#Q 15 remove row where age is missing
df.dropna(subset=["Age"],inplace=True)
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.000000,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,29090.128772,2021-02-17,2025-07-22,44152.000000,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.000000,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.000000,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,29090.128772,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.000000,9.0,barrycrane@example.net,5004696571,InDia
10196,29090.128772,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.000000,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.000000,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,29090.128772,2021-03-16,2025-05-14,18827.000000,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.000000,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
# Q16 standardize gender column
# Convert Gender column to uppercase for consistent processing
df["Gender"] = df["Gender"].astype(str).str.upper()

# Replace variations with 'MALE' or 'FEMALE'
df["Gender"] = df["Gender"].replace({
    "M": "MALE",
    "F": "FEMALE",
    "NAN": "UNKNOWN" # Replace string "NAN" if it exists
})

In [ ]:
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,M,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,MALE,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,FEMALE,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,F,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,FEMALE,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,MALE,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,M,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,FEMALE,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
#17 clean city column
df["City"].str.strip().str.upper()

0          KOLKATA
1              NaN
2        HYDERABAD
3        HYDERABAD
4          CHENNAI
           ...
10195        DELHI
10196    BANGALORE
10197    HYDERABAD
10198          NaN
10199    HYDERABAD
Name: City, Length: 10200, dtype: object

In [ ]:
#Q18 standardize country column to india
df["Country"]=df["Country"].str.strip()
df["Country"].unique()
df.loc[df["Country"].str.upper()=="INDIA"]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,M,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,MALE,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,FEMALE,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,F,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10194,CUST6146,Cody Thompson,F,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10195,CUST10767,Robert Lewis,FEMALE,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10197,CUST6315,Joshua Martinez,M,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,FEMALE,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
#Q19 convert signupdate to datetime
df["Signup_Date"] = pd.to_datetime(df["Signup_Date"])
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,M,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,MALE,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,FEMALE,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,F,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,FEMALE,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,MALE,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,M,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,FEMALE,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [4]:
#Q20 convert lastpurchase date to datetime
df["Last_Purchase_Date"]=pd.to_datetime(df["Last_Purchase_Date"])
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [5]:
#Q21 average purchase amount
df["Purchase_Amount"].mean()

np.float64(29090.128772197408)

In [6]:
# q22 city wise average purchase amount
df.groupby("City")["Purchase_Amount"].mean()

City
BANGALORE    24959.323171
Bangalore    25240.776353
CHENNAI      23454.955056
Chennai      24076.564539
DELHI        25393.291176
Delhi        24778.000000
HYDERABAD    25763.647059
Hyderabad    25205.770231
KOLKATA      24239.810734
Kolkata      37167.563514
MUMBAI       54495.336182
Mumbai       38246.198358
bangalore    54840.375723
chennai      24229.231023
delhi        25656.996970
hyderabad    24439.569767
kolkata      25305.902357
mumbai       23737.648148
Name: Purchase_Amount, dtype: float64

In [7]:
#Q23customers count per city
df["City"].value_counts()

City
Kolkata      820
Mumbai       812
Chennai      784
Bangalore    773
Hyderabad    770
Delhi        763
CHENNAI      404
KOLKATA      395
MUMBAI       393
hyderabad    384
bangalore    383
DELHI        378
delhi        369
BANGALORE    363
HYDERABAD    360
mumbai       352
chennai      343
kolkata      338
Name: count, dtype: int64

In [8]:
#Q24 customers with purchase amount above overall average
df[df["Purchase_Amount"]>df["Purchase_Amount"].mean()]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
10,CUST3260,Jason Mack,MALE,32.0,HYDERABAD,2024-08-14,2025-01-20,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,female,22.0,Mumbai,2023-10-14,2025-04-24,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [9]:
#q25 create customer type column
def customer_type(x):
  if x>30000 :
    return "High value customer"
  else:
    return "Regular"

In [10]:
# apply
df["new_customer"]=df["Purchase_Amount"].apply(customer_type)

In [11]:
df.head()

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country,new_customer
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India,Regular
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india,High value customer
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India,High value customer
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india,High value customer
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India,Regular